{"slug":"finance-intern-sompo-0a9d58","title":"Finance Intern","company":"Sompo","createdDate":"2025-10-29T02:07:04.3361825Z","descriptionHtml":"We are seeking a Finance Intern Hamilton, Bermuda

Our Internship Program will allow students to gain corporate experience, learn about legal and regulatory frameworks, and prepare students with the kind of experience needed for careers in compliance and corporate law.

As a Finance Intern, you will gain broad exposure to the core areas of corporate finance that drive decision-making within a global insurance organization. You will have the opportunity to assist with analysis, reporting, and projects that span financial planning, budgeting, and operational support, while learning how finance supports both corporate functions and business units. This internship provides a strong foundation for anyone interested in pursuing a career in financial management within the insurance industry.

The Sompo Internship Experience

Throughout the program, you will have the opportunity to gain meaningful, hands-on experience within your assigned function, working directly on projects that contribute to our business. You will also take part in structured professional development, participate in our global Executive Speaker Series, and join networking activities with fellow interns, peers, and leaders across the organization. Our program is designed to give you both functional knowledge and broad exposure to the insurance industry, while building skills that will support your future career.

Duties and Responsibilities

 Gain knowledge of the insurance industry and how your function contributes to organizational success

 Contribute to team projects, analysis, and reporting

 Support the execution of day-to-day activities and special initiatives within your function

 Participate in problem-solving and process improvement efforts

 Communicate effectively with team members and share insights with managers and mentors

Qualifications

 Sophomore or Junior enrolled in an accredited university working toward a bachelor’s degree in a relevant field (e.g., Business, Finance, Economics, Accounting, Mathematics, Information Technology, Computer Science, Risk Management, or related disciplines)

 Minimum GPA of 3.0 on a 4.0 scale

 Proficient in Microsoft Word, Excel, and PowerPoint (or similar tools)

 Strong attention to detail and accuracy

 Ability to think critically, analyze information, and contribute ideas

 Effective interpersonal and communication skills

 Ability to work in a fast-paced team environment with shifting priorities

 Must be at least 18 years old and authorized to work in the United States without restriction

 Local to the desired office location or able to secure housing and transportation in the area

Alignment with Core Values

 Accountability – Raises the Bar: Takes ownership of work, follows through on commitments, and delivers high-quality results.

 Agility – Keeps It Simple: Learns quickly, adapts to change, and approaches challenges with a positive, solutions-focused mindset.

 Collaboration – Builds Relationships: Works effectively with peers and mentors, communicates openly, and contributes to a supportive team environment.

 Development – Is Curious: Seeks opportunities to learn, asks questions, and shows enthusiasm for gaining new skills and knowledge.

 Integrity – Is Trustworthy: Demonstrates honesty, respect, and ethical behavior in all interactions.

Salary Range: Actual compensation for this role will depend on several factors including the cost of living associated with your work location, your qualifications, skills, competencies, and relevant experience.

We are Sompo, a global provider of property, casualty, and specialty insurance and reinsurance.

Building on Sompo Holding’s 135 years of innovation, we seek to deliver a unified approach to servicing and providing customized solutions for our clients, ensuring that we meet their needs effectively and consistently.

We strive to strengthen engagement with our clients and business partners every day by using the in-depth knowledge and "}
